HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCpu_reg.h
/** \brief E008, CPUx  Safety Protection Region SPR Write Access Enable Register A0 */
#define CPU1_RGN0_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF882E008u)
/** Alias (User Manual Name) for CPU1_RGN0_ACCENA.
* To use register names with standard convension, please use CPU1_RGN0_ACCENA.
*/
#define CPU1_SPR_SPROT_RGNACCENA0_W (CPU1_RGN0_ACCENA)

/** \brief E00C, CPUx  Safety Protection Region SPR Write Access Enable Register B0 */
#define CPU1_RGN0_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF882E00Cu)
/** Alias (User Manual Name) for CPU1_RGN0_ACCENB.
* To use register names with standard convension, please use CPU1_RGN0_ACCENB.
*/
#define CPU1_SPR_SPROT_RGNACCENB0_W (CPU1_RGN0_ACCENB)

/** \brief E010, CPUx  Safety Protection SPR Region Lower Address Register 1 */
#define CPU1_RGN1_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF882E010u)
/** Alias (User Manual Name) for CPU1_RGN1_LA.
* To use register names with standard convension, please use CPU1_RGN1_LA.
*/
#define CPU1_SPR_SPROT_RGNLA1 (CPU1_RGN1_LA)

/** \brief E014, CPUx  Safety protection SPR Region Upper Address Register 1 */
#define CPU1_RGN1_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF882E014u)
/** Alias (User Manual Name) for CPU1_RGN1_UA.
* To use register names with standard convension, please use CPU1_RGN1_UA.
*/
#define CPU1_SPR_SPROT_RGNUA1 (CPU1_RGN1_UA)

/** \brief E018, CPUx  Safety Protection Region SPR Write Access Enable Register A1 */
#define CPU1_RGN1_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF882E018u)
/** Alias (User Manual Name) for CPU1_RGN1_ACCENA.
* To use register names with standard convension, please use CPU1_RGN1_ACCENA.
*/
#define CPU1_SPR_SPROT_RGNACCENA1_W (CPU1_RGN1_ACCENA)

/** \brief E01C, CPUx  Safety Protection Region SPR Write Access Enable Register B1 */
#define CPU1_RGN1_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF882E01Cu)
/** Alias (User Manual Name) for CPU1_RGN1_ACCENB.
* To use register names with standard convension, please use CPU1_RGN1_ACCENB.
*/
#define CPU1_SPR_SPROT_RGNACCENB1_W (CPU1_RGN1_ACCENB)

/** \brief E020, CPUx  Safety Protection SPR Region Lower Address Register 2 */
#define CPU1_RGN2_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF882E020u)
/** Alias (User Manual Name) for CPU1_RGN2_LA.
* To use register names with standard convension, please use CPU1_RGN2_LA.
*/
#define CPU1_SPR_SPROT_RGNLA2 (CPU1_RGN2_LA)

/** \brief E024, CPUx  Safety protection SPR Region Upper Address Register 2 */
#define CPU1_RGN2_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF882E024u)
/** Alias (User Manual Name) for CPU1_RGN2_UA.
* To use register names with standard convension, please use CPU1_RGN2_UA.
*/
#define CPU1_SPR_SPROT_RGNUA2 (CPU1_RGN2_UA)

/** \brief E028, CPUx  Safety Protection Region SPR Write Access Enable Register A2 */
#define CPU1_RGN2_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF882E028u)
/** Alias (User Manual Name) for CPU1_RGN2_ACCENA.
* To use register names with standard convension, please use CPU1_RGN2_ACCENA.
*/
#define CPU1_SPR_SPROT_RGNACCENA2_W (CPU1_RGN2_ACCENA)

/** \brief E02C, CPUx  Safety Protection Region SPR Write Access Enable Register B2 */
#define CPU1_RGN2_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF882E02Cu)
/** Alias (User Manual Name) for CPU1_RGN2_ACCENB.
* To use register names with standard convension, please use CPU1_RGN2_ACCENB.
*/
#define CPU1_SPR_SPROT_RGNACCENB2_W (CPU1_RGN2_ACCENB)

/** \brief E030, CPUx  Safety Protection SPR Region Lower Address Register 3 */
#define CPU1_RGN3_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF882E030u)
/** Alias (User Manual Name) for CPU1_RGN3_LA.
* To use register names with standard convension, please use CPU1_RGN3_LA.
*/
#define CPU1_SPR_SPROT_RGNLA3 (CPU1_RGN3_LA)

/** \brief E034, CPUx  Safety protection SPR Region Upper Address Register 3 */
#define CPU1_RGN3_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF882E034u)
/** Alias (User Manual Name) for CPU1_RGN3_UA.
* To use register names with standard convension, please use CPU1_RGN3_UA.
*/
#define CPU1_SPR_SPROT_RGNUA3 (CPU1_RGN3_UA)

/** \brief E038, CPUx  Safety Protection Region SPR Write Access Enable Register A3 */
#define CPU1_RGN3_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF882E038u)
/** Alias (User Manual Name) for CPU1_RGN3_ACCENA.
* To use register names with standard convension, please use CPU1_RGN3_ACCENA.
*/
#define CPU1_SPR_SPROT_RGNACCENA3_W (CPU1_RGN3_ACCENA)

/** \brief E03C, CPUx  Safety Protection Region SPR Write Access Enable Register B3 */
#define CPU1_RGN3_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF882E03Cu)
/** Alias (User Manual Name) for CPU1_RGN3_ACCENB.
* To use register names with standard convension, please use CPU1_RGN3_ACCENB.
*/
#define CPU1_SPR_SPROT_RGNACCENB3_W (CPU1_RGN3_ACCENB)

/** \brief E040, CPUx  Safety Protection SPR Region Lower Address Register 4 */
#define CPU1_RGN4_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF882E040u)
/** Alias (User Manual Name) for CPU1_RGN4_LA.
* To use register names with standard convension, please use CPU1_RGN4_LA.
*/
#define CPU1_SPR_SPROT_RGNLA4 (CPU1_RGN4_LA)

/** \brief E044, CPUx  Safety protection SPR Region Upper Address Register 4 */
#define CPU1_RGN4_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF882E044u)
/** Alias (User Manual Name) for CPU1_RGN4_UA.
* To use register names with standard convension, please use CPU1_RGN4_UA.
*/
#define CPU1_SPR_SPROT_RGNUA4 (CPU1_RGN4_UA)

/** \brief E048, CPUx  Safety Protection Region SPR Write Access Enable Register A4 */
#define CPU1_RGN4_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF882E048u)
/** Alias (User Manual Name) for CPU1_RGN4_ACCENA.
* To use register names with standard convension, please use CPU1_RGN4_ACCENA.
*/
#define CPU1_SPR_SPROT_RGNACCENA4_W (CPU1_RGN4_ACCENA)

/** \brief E04C, CPUx  Safety Protection Region SPR Write Access Enable Register B4 */
#define CPU1_RGN4_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF882E04Cu)
/** Alias (User Manual Name) for CPU1_RGN4_ACCENB.
* To use register names with standard convension, please use CPU1_RGN4_ACCENB.
*/
#define CPU1_SPR_SPROT_RGNACCENB4_W (CPU1_RGN4_ACCENB)

/** \brief E050, CPUx  Safety Protection SPR Region Lower Address Register 5 */
#define CPU1_RGN5_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF882E050u)
/** Alias (User Manual Name) for CPU1_RGN5_LA.
* To use register names with standard convension, please use CPU1_RGN5_LA.
*/
#define CPU1_SPR_SPROT_RGNLA5 (CPU1_RGN5_LA)

/** \brief E054, CPUx  Safety protection SPR Region Upper Address Register 5 */
#define CPU1_RGN5_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF882E054u)
/** Alias (User Manual Name) for CPU1_RGN5_UA.
* To use register names with standard convension, please use CPU1_RGN5_UA.
*/
#define CPU1_SPR_SPROT_RGNUA5 (CPU1_RGN5_UA)

/** \brief E058, CPUx  Safety Protection Region SPR Write Access Enable Register A5 */
#define CPU1_RGN5_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF882E058u)
/** Alias (User Manual Name) for CPU1_RGN5_ACCENA.
* To use register names with standard convension, please use CPU1_RGN5_ACCENA.
*/
#define CPU1_SPR_SPROT_RGNACCENA5_W (CPU1_RGN5_ACCENA)

/** \brief E05C, CPUx  Safety Protection Region SPR Write Access Enable Register B5 */
#define CPU1_RGN5_ACCENB /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENB*)0xF882E05Cu)
/** Alias (User Manual Name) for CPU1_RGN5_ACCENB.
* To use register names with standard convension, please use CPU1_RGN5_ACCENB.
*/
#define CPU1_SPR_SPROT_RGNACCENB5_W (CPU1_RGN5_ACCENB)

/** \brief E060, CPUx  Safety Protection SPR Region Lower Address Register 6 */
#define CPU1_RGN6_LA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_LA*)0xF882E060u)
/** Alias (User Manual Name) for CPU1_RGN6_LA.
* To use register names with standard convension, please use CPU1_RGN6_LA.
*/
#define CPU1_SPR_SPROT_RGNLA6 (CPU1_RGN6_LA)

/** \brief E064, CPUx  Safety protection SPR Region Upper Address Register 6 */
#define CPU1_RGN6_UA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_UA*)0xF882E064u)
/** Alias (User Manual Name) for CPU1_RGN6_UA.
* To use register names with standard convension, please use CPU1_RGN6_UA.
*/
#define CPU1_SPR_SPROT_RGNUA6 (CPU1_RGN6_UA)

/** \brief E068, CPUx  Safety Protection Region SPR Write Access Enable Register A6 */
#define CPU1_RGN6_ACCENA /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_RGN_ACCENA*)0xF882E068u)
/** Alias (User Manual Name) for CPU1_RGN6_ACCENA.
* To use register names with standard convension, please use CPU1_RGN6_ACCENA.
*/
#define CPU1_SPR_SPROT_RGNACCENA6_W (CPU1_RGN6_ACCENA)

