HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCpu_reg.h
/** \brief C040, CPUx Data Protection Range 8, Lower Bound Register */
#define CPU2_DPR8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C040u)

/** \brief C044, CPUx Data Protection Range 8, Upper Bound Register */
#define CPU2_DPR8_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C044u)

/** \brief C048, CPUx Data Protection Range 9, Lower Bound Register */
#define CPU2_DPR9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C048u)

/** \brief C04C, CPUx Data Protection Range 9, Upper Bound Register */
#define CPU2_DPR9_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C04Cu)

/** \brief C050, CPUx Data Protection Range 10, Lower Bound Register */
#define CPU2_DPR10_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C050u)

/** \brief C054, CPUx Data Protection Range 10, Upper Bound Register */
#define CPU2_DPR10_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C054u)

/** \brief C058, CPUx Data Protection Range 11, Lower Bound Register */
#define CPU2_DPR11_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C058u)

/** \brief C05C, CPUx Data Protection Range 11, Upper Bound Register */
#define CPU2_DPR11_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C05Cu)

/** \brief C060, CPUx Data Protection Range 12, Lower Bound Register */
#define CPU2_DPR12_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C060u)

/** \brief C064, CPUx Data Protection Range 12, Upper Bound Register */
#define CPU2_DPR12_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C064u)

/** \brief C068, CPUx Data Protection Range 13, Lower Bound Register */
#define CPU2_DPR13_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C068u)

/** \brief C06C, CPUx Data Protection Range 13, Upper Bound Register */
#define CPU2_DPR13_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C06Cu)

/** \brief C070, CPUx Data Protection Range 14, Lower Bound Register */
#define CPU2_DPR14_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C070u)

/** \brief C074, CPUx Data Protection Range 14, Upper Bound Register */
#define CPU2_DPR14_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C074u)

/** \brief C078, CPUx Data Protection Range 15, Lower Bound Register */
#define CPU2_DPR15_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C078u)

/** \brief C07C, CPUx Data Protection Range 15, Upper Bound Register */
#define CPU2_DPR15_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C07Cu)

/** \brief C080, CPUx Data Protection Range 16, Lower Bound Register */
#define CPU2_DPR16_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C080u)

/** \brief C084, CPUx Data Protection Range 16, Upper Bound Register */
#define CPU2_DPR16_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C084u)

/** \brief C088, CPUx Data Protection Range 17, Lower Bound Register */
#define CPU2_DPR17_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_L*)0xF885C088u)

/** \brief C08C, CPUx Data Protection Range 17, Upper Bound Register */
#define CPU2_DPR17_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_DPR_U*)0xF885C08Cu)

/** \brief D000, CPUx Code Protection Range 0 Lower Bound Register */
#define CPU2_CPR0_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D000u)

/** \brief D004, CPUx Code Protection Range 0 Upper Bound Register */
#define CPU2_CPR0_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D004u)

/** \brief D008, CPUx Code Protection Range 1 Lower Bound Register */
#define CPU2_CPR1_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D008u)

/** \brief D00C, CPUx Code Protection Range 1 Upper Bound Register */
#define CPU2_CPR1_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D00Cu)

/** \brief D010, CPUx Code Protection Range 2 Lower Bound Register */
#define CPU2_CPR2_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D010u)

/** \brief D014, CPUx Code Protection Range 2 Upper Bound Register */
#define CPU2_CPR2_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D014u)

/** \brief D018, CPUx Code Protection Range 3 Lower Bound Register */
#define CPU2_CPR3_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D018u)

/** \brief D01C, CPUx Code Protection Range 3 Upper Bound Register */
#define CPU2_CPR3_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D01Cu)

/** \brief D020, CPUx Code Protection Range 4 Lower Bound Register */
#define CPU2_CPR4_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D020u)

/** \brief D024, CPUx Code Protection Range 4 Upper Bound Register */
#define CPU2_CPR4_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D024u)

/** \brief D028, CPUx Code Protection Range 5 Lower Bound Register */
#define CPU2_CPR5_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D028u)

/** \brief D02C, CPUx Code Protection Range 5 Upper Bound Register */
#define CPU2_CPR5_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D02Cu)

/** \brief D030, CPUx Code Protection Range 6 Lower Bound Register */
#define CPU2_CPR6_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D030u)

/** \brief D034, CPUx Code Protection Range 6 Upper Bound Register */
#define CPU2_CPR6_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D034u)

/** \brief D038, CPUx Code Protection Range 7 Lower Bound Register */
#define CPU2_CPR7_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D038u)

/** \brief D03C, CPUx Code Protection Range 7 Upper Bound Register */
#define CPU2_CPR7_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D03Cu)

/** \brief D040, CPUx Code Protection Range 8 Lower Bound Register */
#define CPU2_CPR8_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D040u)

/** \brief D044, CPUx Code Protection Range 8 Upper Bound Register */
#define CPU2_CPR8_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D044u)

/** \brief D048, CPUx Code Protection Range 9 Lower Bound Register */
#define CPU2_CPR9_L /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_L*)0xF885D048u)

/** \brief D04C, CPUx Code Protection Range 9 Upper Bound Register */
#define CPU2_CPR9_U /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPR_U*)0xF885D04Cu)

/** \brief E000, CPUx Code Protection Execute Enable Register Set 0 */
#define CPU2_CPXE_0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_CPXE*)0xF885E000u)

