HAMES2-1st-3/TunnelComfortSystemTesting/include/tc38xa/IfxCpu_reg.h
/** \brief FF04, CPUx Data General Purpose Register 1 */
#define CPU3_D1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF04u)

/** \brief FF08, CPUx Data General Purpose Register 2 */
#define CPU3_D2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF08u)

/** \brief FF0C, CPUx Data General Purpose Register 3 */
#define CPU3_D3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF0Cu)

/** \brief FF10, CPUx Data General Purpose Register 4 */
#define CPU3_D4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF10u)

/** \brief FF14, CPUx Data General Purpose Register 5 */
#define CPU3_D5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF14u)

/** \brief FF18, CPUx Data General Purpose Register 6 */
#define CPU3_D6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF18u)

/** \brief FF1C, CPUx Data General Purpose Register 7 */
#define CPU3_D7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF1Cu)

/** \brief FF20, CPUx Data General Purpose Register 8 */
#define CPU3_D8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF20u)

/** \brief FF24, CPUx Data General Purpose Register 9 */
#define CPU3_D9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF24u)

/** \brief FF28, CPUx Data General Purpose Register 10 */
#define CPU3_D10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF28u)

/** \brief FF2C, CPUx Data General Purpose Register 11 */
#define CPU3_D11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF2Cu)

/** \brief FF30, CPUx Data General Purpose Register 12 */
#define CPU3_D12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF30u)

/** \brief FF34, CPUx Data General Purpose Register 13 */
#define CPU3_D13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF34u)

/** \brief FF38, CPUx Data General Purpose Register 14 */
#define CPU3_D14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF38u)

/** \brief FF3C, CPUx Data General Purpose Register 15 */
#define CPU3_D15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_D*)0xF887FF3Cu)

/** \brief FF80, CPUx Address General Purpose Register 0 */
#define CPU3_A0 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF80u)

/** \brief FF84, CPUx Address General Purpose Register 1 */
#define CPU3_A1 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF84u)

/** \brief FF88, CPUx Address General Purpose Register 2 */
#define CPU3_A2 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF88u)

/** \brief FF8C, CPUx Address General Purpose Register 3 */
#define CPU3_A3 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF8Cu)

/** \brief FF90, CPUx Address General Purpose Register 4 */
#define CPU3_A4 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF90u)

/** \brief FF94, CPUx Address General Purpose Register 5 */
#define CPU3_A5 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF94u)

/** \brief FF98, CPUx Address General Purpose Register 6 */
#define CPU3_A6 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF98u)

/** \brief FF9C, CPUx Address General Purpose Register 7 */
#define CPU3_A7 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FF9Cu)

/** \brief FFA0, CPUx Address General Purpose Register 8 */
#define CPU3_A8 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFA0u)

/** \brief FFA4, CPUx Address General Purpose Register 9 */
#define CPU3_A9 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFA4u)

/** \brief FFA8, CPUx Address General Purpose Register 10 */
#define CPU3_A10 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFA8u)

/** \brief FFAC, CPUx Address General Purpose Register 11 */
#define CPU3_A11 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFACu)

/** \brief FFB0, CPUx Address General Purpose Register 12 */
#define CPU3_A12 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFB0u)

/** \brief FFB4, CPUx Address General Purpose Register 13 */
#define CPU3_A13 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFB4u)

/** \brief FFB8, CPUx Address General Purpose Register 14 */
#define CPU3_A14 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFB8u)

/** \brief FFBC, CPUx Address General Purpose Register 15 */
#define CPU3_A15 /*lint --e(923, 9078)*/ (*(volatile Ifx_CPU_A*)0xF887FFBCu)


/** \}  */

/******************************************************************************/

/******************************************************************************/

#endif /* IFXCPU_REG_H */
